[
	{
		"title": "New Features for the Metadata Aggregator for Reusable / Reproducible Science (MARS)",
		"description": "<a href=https://github.com/Brain-Development-and-Disorders-Lab/mars target=_blank>MARS</a> is an open-source and customizable data management tool for organizing, linking, and tracking metadata generated from scientific experiments. During this engagement, we added new functionality to MARS to increase its adoption across new scientific domains and with new research laboratories.",
		"background": "mars-background.jpeg",
		"cover": "mars.png",
		"takeaways": [
			{
				"description": "New functionality to increase adoption of MARS across new scientific domains and with new research laboratories",
				"children": [
					"Entity Search Improvement - optimized and stabilized the search engine; also enabled more parameters in the search query.",
					"User Interface Improvements - improved usability and visual appeal with professional-grade input fields and responsive buttons.",
					"Server Security Enhancements - Strengthened server security by integrating ORCiD verification.",
					"CI/CD Enhancements - Established a robust pipeline to automate testing and deployment processes.",
					"Deployment Enhancements - Refactored environment-specific settings to streamline deployments across different stages (dev, test, prod)."
				]
			}
		],
		"start_date": "November 2023",
		"end_date": "May 2024"
	},
	{
		"title": "A Web Portal for the Ramanujan Machine & Automated Search Algorithm Deployment to the BOINC Distributed-Computing Platform via GitHub Actions",
		"description": "<a href=https://www.ramanujanmachine.com/ target=_blank>The Ramanujan Machine</a> is a novel way to find new mathematical formulas relating fundamental constants, usually discovered sporadically by mathematical intuition or ingenuity, by harnessing computer algorithms. We built a user-friendly web application that invokes the Ramanujan Machine algorithms and returns potential discoveries to the user along with any results returned from an integration with Wolfram Alpha.",
		"background": "ramanujan_background.jpeg",
		"cover": "ramanujan_machine.png",
		"takeaways": [
			{
				"description": "A web portal to make search algorithms accessible to the public",
				"children": [
					"React web application that prompts users for polynomials",
					"Integration with existing Ramanujan Machine algorithms",
					"Integration with Wolfram Alpha API",
					"Integration with MathJax to pretty-print polynomial continued fractions entered by users",
					"Custom d3.js charts"
				]
			},{
				"description": "Automation of the deployment of new algorithms to the BOINC distributed computing platform",
				"children": [
					"Building Windows, Mac and Linux binaries from Python algorithms using cx_Freeze",
					"Creating BOINC-required xml files and peforming code-signing on deployment bundle",
					"Deploying to BOINC server from GitHub repository using GitHub Actions"
				]
			}
		],
		"start_date": "November 2023",
		"end_date": "May 2024"
	},
	{
		"title": "Kokkos Accelerated Machine Learned Interatomic Potential",
		"description": "During this engagement, we evaluated the performance characteristics of simulations based on <a href=https://arxiv.org/abs/2401.00096 target=_blank>foundational model</a> for machine learned inter-atomic potential jointly proposed by a team of 60 scientists . ",
		"background": "sprint-kokkos-generated.png",
		"logos": [
			{
				"image": "https://kokkos.org/img/kokkos-logo.png",
				"alt": "The Kokkos C++ Performance Portability Ecosystem is a production level solution for writing modern C++ applications in a hardware agnostic way.",
				"url": "https://kokkos.org/"
			},
			{
				"image": "https://www.lammps.org/movies/logo.gif",
				"alt": "LAMMPS is a classical molecular dynamics code with a focus on materials modeling. It's an acronym for Large-scale Atomic/Molecular Massively Parallel Simulator.",
				"url": "https://www.lammps.org/"
			}
		],
		"takeaways": [
			{
				"description": "Profiling, Kokkosification and Performance Optimization of Sprint Library in LAMPPS",
				"children": [
					"8x improvement in standard C++ baseline implementation after initial profiling and improvement suggestions",
					"(Ongoing) Implementation using Kokkos for inter-operatibility and profiling, performance optimizations for OpenMP, CUDA resulting in first-of-its kind GPU performance baselines"
				]
			}
		],
		"start_date": "June 2024",
		"end_date": "TBD"
	},
	{
		"title": "Performance Enhancements for Simulations that Target Intrinsically Disordered Proteins (IDPs) with Therapeutic Small Molecules",
		"description": "During this engagement, we evaluated the performance characteristics of simulations based on <a href=https://www.gromacs.orgheller target=_blank>GROMACS</a> and <a href=https://www.plumed.org/ target=_blank>PLUMED</a>, which target Intrinsically Disordered Proteins (IDPs) with Therapeutic Small Molecules. After the evaluation, we worked with the PLUMED team to introduce changes that resulted in significant performance improvements.",
		"background": "proteins10.png",
		"cover": "proteins.png",
		"logos": [
			{
				"image": "https://www.gromacs.org/_static/gmx_logo_blue.png",
				"alt": "Gromacs, a free and open-source software suite for high-performance molecular dynamics and output analysis",
				"url": "https://www.gromacs.org"
			},
			{
				"url": "https://www.plumed.org/",
				"alt": "Plumed, the community-developed PLUgin for MolEcular Dynamics",
				"image": "https://www.plumed.org//pigeon.png"
			}
		],
		"takeaways": [
			{
				"description": "Improved the efficiency of metainference simulations with PLUMED",
				"children": [
					"68% improvement over CPU baseline",
					"53% improvement over GPU baseline",
					"Profiled multiple simulations, revealing PLUMED is not a significant bottleneck in these simulations and added documentation so that others can generate profile data",
					"Ensured backward compatibility for existing PLUMED simulations"
				]
			}
		],
		"start_date": "May 2023",
		"end_date": "September 2023"
	},
	{
		"title": "Icetemp: Converting a Jupyter Notebook to a Python Package",
		"description": "<a href=https://github.com/sashamontelli/borehole_temperature_models target=_blank>Icetemp</a> is a numerical heat flow model that infers long-term climate and glacial history using Bayesian inversion of in-situ borehole temperature measurements previously taken in Antarctica. During this engagement, we converted the Icetemp algorithm, written as a Jupyter Notebook, into a Python package available on PyPi, complete with automated testing and Continuous Integration / Delivery / Deployment.",
		"cover": "montelli.png",
		"background": "icecore5.png",
		"takeaways": [
			{
				"description": "Created a professionally tested Python library from Jupyter Notebook code",
				"children": [
					"multi-platform continuous integration (CI) workflow",
					"automated tests",
					"automatic deploys to PyPi",
					"Improved performance of existing model by 20%",
					"Ensured the functionality is open to the science community"
				]
			}
		],
		"start_date": "June 2023",
		"end_date": "September 2023"
	},
	{
		"title": "FastANI: Improving the Quality of a Python Package",
		"description": "<a href=https://github.com/ParBLiSS/FastANI target=_blank>FastANI</a> is an HPC-oriented Python package to perform whole-genome Average Nucleotide Identity (ANI). FastANI allows for quickly comparing two genomes to find matches in their genetic structure. During this engagement, we improved the quality of the FastANI Python package.",
		"cover": "FastANI.png",
		"background": "dna10.png",
		"takeaways": [
			{
				"description": "Improved the quality of the FastANI Python package",
				"children": [
					"Developed tests and CI/CD to facilitate future updates",
					"Released a new version of FastANI",
					"Updated build system",
					"Performed repository clean up"
				]
			}
		],
		"start_date": "September 2022",
		"end_date": "August 2023"
	}
]
